#+TITLE: Website Source Code
#+DESCRIPTION: The source code for my blog, presented in a nice HTML file with commentary.
#+PROPERTY: header-args :noweb no-export
#+ROAM_TAGS: website public source-code

** Source Directories
:PROPERTIES:
:ID:       1914d8ce-65d2-4ced-94e1-daaed92677e5
:END:
As of generating this file, thce directory above it contains the following files. 
#+BEGIN_SRC sh :exports results :results verbatim
ls ../ -nA
#+END_SRC

#+RESULTS:
#+begin_example
total 36
-rw-r--r-- 1 1000 998  114 Mar 30 16:31 .cider-repl-history
-rw-r--r-- 1 1000 998 1752 Apr  3 20:57 dir-locals.el
drwxr-xr-x 8 1000 998 4096 Apr  3 21:10 .git
-rw-r--r-- 1 1000 998  240 Apr  3 20:57 .gitignore
-rw-r--r-- 1 1000 998    5 Apr  3 20:57 .nrepl-port
-rw-r--r-- 1 1000 998  209 Mar 28 22:16 project.clj
drwxr-xr-x 4 1000 998 4096 Apr  3 20:58 public
drwxr-xr-x 2 1000 998 4096 Apr  3 20:49 src
drwxr-xr-x 4 1000 998 4096 Apr  3 20:57 target
#+end_example

The ~project.clj~ and ~target~ directories are automatically generated as are the dotfiles, while the ~src~ and ~public~ directories are not generated by any code. The ~src~ directory of course contains the org files while the ~public~ contains exported HTML. We set variables for these since the [[Automatic Publishing Function][automatic publishing function]] (WIP) also needs to know the directories. To find the location of the project itself I use [[https://github.com/bbatsov/projectile][projectile]].
#+NAME: emacs-directories
#+BEGIN_SRC emacs-lisp
(cd-source-dir (concat (projectile-project-root) "src/"))
(cd-publish-dir (concat (projectile-project-root) "public/"))
#+END_SRC

Here we add them to the project configuration. The ~:base-directory~ property is source for the project and the ~:publishing-directory~ is where the results of exporting are to be placed.
#+NAME: emacs-site-files
#+BEGIN_SRC emacs-lisp
:base-directory ,cd-source-dir
:publishing-directory ,cd-publish-dir
#+END_SRC

